module.exports.config = {
  name: "autotime",
  version: "1.0.0",
  permission: 0,
  credits: "SK-SIDDIK",
  prefix: true,
  category: "group messenger",
  premium: false,
  usages: "auto",
  cooldowns: 3,
};

const nam = [{
    timer: '12:04:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    এখন রাত ১১ টা বাজে সারা দিনের\n হিসাব টামিলিয়ে নিয়ো আল্লাহ্ কার কাছে \n                সব হিসাবই দিতে হবে\n☽━━━━━━━━━━━━━━━━━━☾']
},
             {
    timer: '1:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n.               اللهم باسمك أموت وأحيا\n      আল্লাহ তোমার নামে ঘুমালাম তোমার\n              নামেই যেনো উঠি \n      রাত ১২ টা বাজে সবাই ঘুমাও\n☽━━━━━━━━━━━━━━━━━━☾']
},
						{
    timer: '2:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n     রাত ১ টা বাজে সবাই হয়তো ঘুমে\n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '3:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    রাত ২ টা বাজে আমার ঘুম নাই 😭\n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '4:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n         রাত ৩ টা বাজে এখন মধ্য রাত\n     আল্লাহ প্রথম আসমানে এসে বান্দা \n    দের ডাকে আর বলে কার প্রোয়জন\n                 আমার কাছে চাও\n☽━━━━━━━━━━━━━━━━━━☾ ']
},
						 {
    timer: '5:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n      এখন রাত ৪ টা বাজে একটু পর\n তাহাজ্জুদএর সময় শেষ হয়ে যাবে যাদের\n                সম্ভব তারা পরে নিও\n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '6:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    এখন ফজর  নামাজের সময় আর না\n ঘুমিয়ে উঠো ফজরের নামাজ আদায় করো।\n          এখন ভোর ৫ টা বাজে\n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '7:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n   সবাই ফজরের নামাজ আদায় করেছেন \n                         কি?\n           এখন তো ভোর ৬ টা বাজে\n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '8:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n   সবাই সবার কাজে চলে যাও রিযিক এর\n   মালিক আল্লাহ কিন্তু সেই রিযিক খোঁজে \n             বের করা আমাদের কাজ\n              এখন সময় সকাল ৭টা\n☽━━━━━━━━━━━━━━━━━━☾ ']
},
						 {
    timer: '9:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n  সবাই হয়তো কাজে আছে আমার কেমন \n            একা একা লাগতেছে 🥺\n            এখন সময় সকাল ৮টা\n☽━━━━━━━━━━━━━━━━━━☾']
},
             {
    timer: '10:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n                সবার নাস্তা হয়েছে কি?\n            এখন তো সকাল ৯টা বাজে\n☽━━━━━━━━━━━━━━━━━━☾' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    কি করো সবাই তোমাদের অনেক মিস\n                            করতেছি\n             এখন সকাল ১০ টা বাজে🥺\n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '12:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n            সময় গুলো কেমন তাইনা?\n       যেই সময় একবার চলে যায় তা\n            \nআর ফিরে আসেনা ,😅\n            এখন সকাল ১১টা বাজে\n☽━━━━━━━━━━━━━━━━━━☾']
},					
						 {
    timer: '1:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    দেখতে দেখতে সকাল শেষ দুপুর চলে\n  আসলো সবাই জোহরের নামাজ পড়তে \n                   ভুলে যেয়োনা\n\n           এখন সময় দুপুর ১২ টা\n☽━━━━━━━━━━━━━━━━━━☾️ ']
},
						 {
    timer: '2:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n জোহরের আযান দিয়েছে সবাই নামাজ\n             এ যাও \n             এখন  দুপুর ১ টা বাজে\n☽━━━━━━━━━━━━━━━━━━☾ ']
},
						 {
    timer: '3:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n     এখন দুপুর ২ টা বাজে সবাই খাবার \n                  খেয়েছেন কি?\n☽━━━━━━━━━━━━━━━━━━☾️']
},
						 {
    timer: '4:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n এখন দুপুর ৩ টা বাজে সবাই নিজের স্বাস্থ্য\n       ঠিক রাখতে একটু বিশ্রাম করুন\n☽━━━━━━━━━━━━━━━━━━☾']
},
						{
    timer: '5:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n  এখন বিকাল ৪ টা বাজে আসরের ওয়াক্ত\n    কি আসরের নামাজ পড়তে ভুলবেননা\n☽━━━━━━━━━━━━━━━━━━☾ ']
},
						 {
    timer: '6:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n এখন বিকাল ৫ টা বাজে একটু ঘুরাঘুরি\n              করলে মনটা ফ্রেশ থাকবে \n☽━━━━━━━━━━━━━━━━━━☾']
},
						 {
    timer: '7:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n এখন সন্ধ্যা ৬টা বাজে মাগরিবের নামাজ \n                      পরে নিয়েন সবাই\n☽━━━━━━━━━━━━━━━━━━☾']
},
             {
    timer: '8:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n  এখন ৭ টা বাজে চলো সবাই আড্ডা দেই\n☽━━━━━━━━━━━━━━━━━━☾']
},
             {
    timer: '9:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n      এখন রাত ৮ টা বাজে এশার নামাজ\n                    পড়েছো কে কে\n☽━━━━━━━━━━━━━━━━━━☾']
},
             {
    timer: '10:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    এখন রাত ৯টা বাজে সারাদিন কেমন\n                     কাটলো বন্ধু\n☽━━━━━━━━━━━━━━━━━━☾']
},
            {
    timer: '11:00:00 PM',
    message: ['☽━━━━━━━━━━━━━━━━━━☾\n    এখন রাত ১০ টা বাজে রাতের খাবার    \n                 খেয়েছো কি\n☽━━━━━━━━━━━━━━━━━━☾']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
