module.exports.config = {
  name: "দোয়া",
  version: "1.0.0",
  permission: 0,
  credits: "SK-SIDDIK",
  prefix: true,
  description: "",
  category: "user",
  premium: false,
  usages: "দোয়া",
  cooldowns: 5,
};

module.exports.run = async ({ api, event }) => {
  const { threadID, messageID, senderID } = event;
  async function getUserInfo(userID) {
    const userInfo = await api.getUserInfo(userID);
    return { gender: userInfo[userID].gender };
  }

  const siddik = [
    "আযানের জবাব দেয়া :\n “যখন তোমরা আযান শুনতে পাও তখন মুয়াজ্জিন যা বলে তার পুনরাবৃত্তি করে যাও। যখন আযান শেষ হয় তখন ((দায়া )চাও, তোমাকে দেয়া হবে।” [আবু দাউদ, আন নাসাঈ]",
    "রমজানের এবং শান্তিয়ালের রোজা রাখা :\n “যে ব্যক্তি রমজানের রোজা রাখলো, তারপর শাওয়ালের ৬টি রোজা রাখলো সে যেন এক বছর রোজা রাখলো।” [মুসলিম]",
    "প্রত্যেক মাসে ৩টি রোজা রাখা :\n“প্রত্যেক মাসে ৩টি রোজা রাখা সারা বছর রোজা রাখার সমান।” [বুখারী, মুসলিম]",
    "নফল রোজা রাখা :\n “যে ব্যক্তি স্বেচ্ছায় (ইচ্ছামত) রোজা রাখবে, তার জন্য সর্বোচ্চ পুরস্কার থাকবে।” [আবু দাউদ]",
    "যে ব্যক্তি দাঁড়িয়ে সালাত পড়েছে সে কিভাবে নফল রোজা রাখবে?",
    "অন্ধকারে আল্লাহর কাছে দোয়া করা :\n “রাতের শেষ অংশে আল্লাহ তাআলা পৃথিবীর আকাশে নেমে আসেন এবং বলেন: কে আছে যে, আমি তার দোয়া গ্রহণ করব।” [বুখারী, মুসলিম]",
    "প্রথমে ওজু করে রমজানের রোজা রাখার জন্য দোয়া করা :\n “যে ব্যক্তি রমজানের রোজা রেখে ইফতার করতে চাইবে তার জন্য আল্লাহ তার দোয়া কবুল করবেন।” [মুসলিম]",
    "আল-মুত্তাকিনের সাহায্য করা :\n “যে ব্যক্তি আল্লাহর পথে খরচ করবে, আল্লাহ তার সাহায্য করবেন।” [বুখারী]",
    "শান্তির পথে থাকা :\n “যে ব্যক্তি আল্লাহর পথে যেতে থাকলে, সে শান্তির পথে থাকবে।” [মুসলিম]",
    "পিপঁড়ে বা মাকড়সার অঙ্গ-প্রত্যঙ্গ তুলে নেয়া :\n “যে ব্যক্তি পিপঁড়ে বা মাকড়সার অঙ্গ-প্রত্যঙ্গ তুলে নেবে সে শান্তির পথে থাকবে।” [আবু দাউদ]",
    "অন্যকে ঈমানের পথে সাহায্য করা :\n “যে ব্যক্তি আল্লাহর পথে সহযোগিতা করবে, সে সর্বোত্তম সাহায্যকারী।” [আবু দাউদ]",
    "যে ব্যক্তি দোয়া করবে তার জন্য আল্লাহ রহমত নাযিল করবেন :\n “যে ব্যক্তি দোয়া করবে তার জন্য আল্লাহ রহমত নাযিল করবেন।” [আবু দাউদ]",
    "যে ব্যক্তি হারাম কাজে যুক্ত হবে না, আল্লাহ তাকে জান্নাতে প্রবেশ করাবে। :\n “যে ব্যক্তি হারাম কাজে যুক্ত হবে না, আল্লাহ তাকে জান্নাতে প্রবেশ করাবে।” [বুখারী, মুসলিম]",
    "যে ব্যক্তি জিকির করবে, আল্লাহ তাকে সাহায্য করবেন :\n “যে ব্যক্তি আল্লাহর জিকির করবে, আল্লাহ তাকে সাহায্য করবেন।” [বুখারী]",
    "যে ব্যক্তি দুঃখের সময় ধৈর্যশীল থাকবে, সে আল্লাহর কাছে সর্বোত্তম পুরস্কার লাভ করবে। :\n “যে ব্যক্তি দুঃখের সময় ধৈর্যশীল থাকবে, সে আল্লাহর কাছে সর্বোত্তম পুরস্কার লাভ করবে।” [মুসলিম]",
    "তাওবা ও ইসলামের পুনর্নবীকরণ করা :\n “যে ব্যক্তি তাওবা করে এবং ইসলামের পুনর্নবীকরণ করে, তার জন্য মহান আল্লাহ সৎকর্মের পুরস্কার দান করবেন।” [আবু দাউদ]",
    "মৃত্যুর পরে কারও জন্য সাহায্য করা :\n “যে ব্যক্তি মৃত্যুর পরে কাউকে সাহায্য করবে, তার জন্য দুনিয়া ও আখিরাতে পুরস্কার থাকবে।” [বুখারী, মুসলিম]",
    "স্বার্থপরতা না করার জন্য অঙ্গীকার করা :\n “যে ব্যক্তি স্বার্থপরতা থেকে দূরে থাকবে, তার জন্য জান্নাতে প্রবেশ করার সুযোগ থাকবে।” [মুসলিম]",
    "আল্লাহর পথ অনুসরণ করা :\n “যে ব্যক্তি আল্লাহর পথে চলে, সে শান্তির পথে থাকবে।” [বুখারী]",
  ];

  const randomIndex = Math.floor(Math.random() * siddik.length);
  const selectedMessage = siddik[randomIndex];

  api.sendMessage(selectedMessage, threadID, messageID);
};
